In [2]:
import pandas as pd

In [62]:
df = pd.read_csv('Case for Homework for students - Data.csv')
df.head()

,data,cohort,uuid,buyer,new buyer,aov,cogs,ltc,month,n_payment
0,5/1/2024,2024-05,be239004-bc93-4732-8d2e-db1c9abc70f9,-,False,0,0.0,0,2024-5,NaN
1,5/1/2024,2024-05,ff709093-05bd-4c07-8d47-20a1e22450df,-,False,0,0.0,8,2024-5,NaN
2,5/1/2024,2024-05,024c15c8-33a9-4f4c-b471-c47a2364dc30,-,False,0,0.0,8,2024-5,NaN
3,5/1/2024,2024-05,3186905a-cf69-40fe-a615-51342cc6158b,-,False,0,0.0,8,2024-5,NaN
4,5/1/2024,2024-05,919338ce-b051-4c7a-aa3c-e7c951644a77,-,False,0,0.0,0,2024-5,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59318 entries, 0 to 59317
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   data       59318 non-null  object
 1   cohort     59318 non-null  object
 2   uuid       59318 non-null  object
 3   buyer      59318 non-null  object
 4   new buyer  59318 non-null  bool
 5   aov        59318 non-null  int64
 6   cogs       59318 non-null  float64
 7   ltc        59318 non-null  int64
 8   month      59318 non-null  object
 9   n_payment  0 non-null      float64
dtypes: bool(1), float64(2), int64(2), object(5)
memory usage: 4.1+ MB

In [63]:
df['data'] = pd.to_datetime(df.data, errors = 'coerce')
df.head()

,data,cohort,uuid,buyer,new buyer,aov,cogs,ltc,month,n_payment
0,2024-05-01,2024-05,be239004-bc93-4732-8d2e-db1c9abc70f9,-,False,0,0.0,0,2024-5,NaN
1,2024-05-01,2024-05,ff709093-05bd-4c07-8d47-20a1e22450df,-,False,0,0.0,8,2024-5,NaN
2,2024-05-01,2024-05,024c15c8-33a9-4f4c-b471-c47a2364dc30,-,False,0,0.0,8,2024-5,NaN
3,2024-05-01,2024-05,3186905a-cf69-40fe-a615-51342cc6158b,-,False,0,0.0,8,2024-5,NaN
4,2024-05-01,2024-05,919338ce-b051-4c7a-aa3c-e7c951644a77,-,False,0,0.0,0,2024-5,NaN

In [32]:
print(df.dtypes)

data         datetime64[ns]
cohort               object
uuid                 object
buyer                object
new buyer              bool
aov                   int64
cogs                float64
ltc                   int64
month                object
n_payment           float64
dtype: object

In [33]:
uniq_uuid = pd.Series(df.uuid).value_counts().count()
uniq_uuid

np.int64(41451)

In [64]:
df['month_period'] = df.data.dt.to_period('M')
df.head()

,data,cohort,uuid,buyer,new buyer,aov,cogs,ltc,month,n_payment,month_period
0,2024-05-01,2024-05,be239004-bc93-4732-8d2e-db1c9abc70f9,-,False,0,0.0,0,2024-5,NaN,2024-05
1,2024-05-01,2024-05,ff709093-05bd-4c07-8d47-20a1e22450df,-,False,0,0.0,8,2024-5,NaN,2024-05
2,2024-05-01,2024-05,024c15c8-33a9-4f4c-b471-c47a2364dc30,-,False,0,0.0,8,2024-5,NaN,2024-05
3,2024-05-01,2024-05,3186905a-cf69-40fe-a615-51342cc6158b,-,False,0,0.0,8,2024-5,NaN,2024-05
4,2024-05-01,2024-05,919338ce-b051-4c7a-aa3c-e7c951644a77,-,False,0,0.0,0,2024-5,NaN,2024-05

In [65]:
df['uuid'] = df['uuid'].dropna()

In [76]:
# Сначала отсортируем по дате и удалим дубликаты, оставив только первое вхождение для каждого uuid
df_sorted = df.sort_values('data')  # Убедитесь, что дата отсортирована
df_unique = df_sorted.drop_duplicates(subset=['uuid'], keep='first')

# Теперь, после удаления дубликатов, сгруппируем по месяцам и посчитаем уникальные uuid
grouped_df = df_unique.groupby('month_period')['uuid'].nunique()

print(grouped_df)

unique_uuids_overall = df_unique['uuid'].nunique()
print("Общее количество уникальных uuid:", unique_uuids_overall)

month_period
2024-05     9810
2024-06    14547
2024-07    17094
Freq: M, Name: uuid, dtype: int64
Общее количество уникальных uuid: 41451

In [73]:
# Суммируем уникальные uuid по всем месяцам
unique_uuids_overall = df_unique['uuid'].nunique()
print("Общее количество уникальных uuid:", unique_uuids_overall)

Общее количество уникальных uuid: 41451

In [74]:
# Печатаем количество уникальных uuid по каждому месяцу
print(grouped_df)

# Если нужно подсчитать общее количество уникальных uuid в датасете (как на весь датасет, так и по месяцам)
total_unique_uuids = monthly_uuids.sum()  # Суммируем уникальные uuid по месяцам
print("Сумма уникальных uuid по месяцам:", total_unique_uuids)

{Period('2024-05', 'M'): 9810, Period('2024-06', 'M'): 14547, Period('2024-07', 'M'): 17094}
Сумма уникальных uuid по месяцам: 59120

In [48]:
# unique_uuids = df['uuid'].nunique()
# print("Уникальные uuid:", unique_uuids)

Уникальные uuid: 41451

In [53]:
# df_unique = df.drop_duplicates(subset=['uuid', 'month_period'], keep='first')

In [56]:
# grouped_df = df_unique.groupby('month_period')['uuid'].count().to_dict()
# grouped_df

{Period('2024-05', 'M'): 9810,
 Period('2024-06', 'M'): 20864,
 Period('2024-07', 'M'): 28446}

In [51]:
df.describe()

,data,aov,cogs,ltc,n_payment,month_new
count,59120,59318.000000,59318.000000,59318.000000,0.0,59120.000000
mean,2024-06-25 02:24:30.690121984,0.125594,0.016327,5.417664,NaN,6.315223
min,2024-05-01 00:00:00,0.000000,0.000000,0.000000,NaN,5.000000
25%,2024-06-08 00:00:00,0.000000,0.000000,0.000000,NaN,6.000000
50%,2024-06-29 00:00:00,0.000000,0.000000,7.000000,NaN,6.000000
75%,2024-07-15 00:00:00,0.000000,0.000000,8.000000,NaN,7.000000
max,2024-07-31 00:00:00,10.000000,1.300000,10.000000,NaN,7.000000
std,NaN,1.113638,0.144773,3.727902,NaN,0.740091

In [52]:
# Проверяем количество уникальных uuid в каждом месяце
monthly_uuids = df.groupby('month_period')['uuid'].nunique()

# Печатаем количество уникальных uuid по каждому месяцу
print(monthly_uuids)

# Если нужно подсчитать общее количество уникальных uuid в датасете (как на весь датасет, так и по месяцам)
total_unique_uuids = monthly_uuids.sum()  # Суммируем уникальные uuid по месяцам
print("Сумма уникальных uuid по месяцам:", total_unique_uuids)

month_period
2024-05     9810
2024-06    20864
2024-07    28446
Freq: M, Name: uuid, dtype: int64
Сумма уникальных uuid по месяцам: 59120